---
type: GroundConductorSizeSet
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 10
tags: [revit-api, class]
---

# GroundConductorSizeSet

`Autodesk.Revit.DB.Electrical.GroundConductorSizeSet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | GroundConductorSizeSet | — | `public GroundConductorSizeSet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( GroundConductorSize item )` |
| Method | Erase | — | `public virtual int Erase ( GroundConductorSize item )` |
| Method | ForwardIterator | — | `public virtual GroundConductorSizeSetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( GroundConductorSize item )` |
| Method | ReverseIterator | — | `public virtual GroundConductorSizeSetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |